app/views/comments/_comments.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 1]]
---
<% @recipe.comments.each do |comment| %>