app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    if current_user.admin?
      @categories = Category.all

INSERT INTO "categories" ("name", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Main Dishes"], ["created_at", "2018-01-19 15:04:14.135589"], ["updated_at", "2018-01-19 15:04:14.135589"], ["user_id", 1]]
---
  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save