app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("comment_entry", "recipe_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment_entry", "Test"], ["recipe_id", 1], ["created_at", "2018-02-01 17:33:55.085214"], ["updated_at", "2018-02-01 17:33:55.085214"], ["user_id", 1]]