app/controllers/recipes_controller.rb

SELECT  "recipes".* FROM "recipes" LIMIT $1 OFFSET $2  [["LIMIT", 8], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes"
---
  def index
    @recipes = if params[:term]
                 Recipe.where('name ILIKE ?', "%#{params[:term]}").page(params[:page]).per(8)
               else
                 Recipe.all.page(params[:page]).per(8)

SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1 ORDER BY created_at DESC  [["recipe_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "reviews".* FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 1]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."recipe_id" = $1  [["recipe_id", 1]]
---
  def show
    @comment = Comment.new
    @reviews = Review.where(recipe_id: @recipe.user_id).order('created_at DESC')

    if @reviews.blank?
      @avg_review = 0.00001
    else
      @avg_review = @reviews.average(:rating).round(2, :default)

SELECT "categories".* FROM "categories"
---
  def new
    @recipe = Recipe.new
    @categories = Category.all

INSERT INTO "recipes" ("ingredient_list", "instruction_list", "user_id", "created_at", "updated_at", "name", "description", "image", "category_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."category_id" = $1 LIMIT $2 OFFSET $3  [["category_id", 1], ["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."category_id" = $1  [["category_id", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def items_by_category
    @recipes = Recipe.where(category_id: params[:cat_id]).page(params[:page]).per(2)
    @category = Category.find(params[:cat_id])