app/controllers/reviews_controller.rb

  def new
    @reviews = Review.where(recipe_id: @recipe.user_id).order('created_at DESC')
---
SELECT "reviews"."user_id" FROM "reviews" WHERE "reviews"."recipe_id" = $1 ORDER BY created_at DESC  [["recipe_id", 1]]

  def create
    @reviews = Review.where(recipe_id: @recipe.id).order('created_at DESC')
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.recipe_id = @recipe.id

    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("rating", "created_at", "updated_at", "user_id", "recipe_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["rating", 4], ["created_at", "2018-01-19 15:04:43.585296"], ["updated_at", "2018-01-19 15:04:43.585296"], ["user_id", 1], ["recipe_id", 1]]

  def set_recipe
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]